In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33],
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [15]:
df[['age']].values

array([[23],
       [78],
       [22],
       [19],
       [45],
       [33]])

In [11]:
df[(df['age'] > 40) & (df['num_pets'] > 0)]

   name  age state  num_children  num_pets
1  mary   78    dc             2         4

In [ ]:
101